In [33]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

      data1     data2 key1 key2
0 -0.523777 -0.090309    a  one
1  0.303250  0.580947    a  two
2  0.551000 -0.542599    b  one
3 -0.780171  0.245335    b  two
4 -1.205029  1.641572    a  one

In [34]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [35]:
grouped.mean()

key1
a   -0.475185
b   -0.114585
Name: data1, dtype: float64

In [36]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.864403
      two     0.303250
b     one     0.551000
      two    -0.780171
Name: data1, dtype: float64

In [37]:
means.unstack()

key2       one       two
key1
a    -0.864403  0.303250
b     0.551000 -0.780171

In [38]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

California  2005    0.303250
            2006    0.551000
Ohio        2005   -0.651974
            2006   -1.205029
Name: data1, dtype: float64

In [39]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.475185  0.710737
b    -0.114585 -0.148632

In [40]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.864403  0.775632
     two   0.303250  0.580947
b    one   0.551000 -0.542599
     two  -0.780171  0.245335

In [41]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [42]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.523777 -0.090309    a  one
1  0.303250  0.580947    a  two
4 -1.205029  1.641572    a  one
b
      data1     data2 key1 key2
2  0.551000 -0.542599    b  one
3 -0.780171  0.245335    b  two

In [43]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0 -0.523777 -0.090309    a  one
4 -1.205029  1.641572    a  one
('a', 'two')
     data1     data2 key1 key2
1  0.30325  0.580947    a  two
('b', 'one')
   data1     data2 key1 key2
2  0.551 -0.542599    b  one
('b', 'two')
      data1     data2 key1 key2
3 -0.780171  0.245335    b  two

In [44]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2  0.551000 -0.542599    b  one
3 -0.780171  0.245335    b  two

In [45]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [46]:
grouped = df.groupby(df.dtypes,axis=1)

In [47]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.523777 -0.090309
1  0.303250  0.580947
2  0.551000 -0.542599
3 -0.780171  0.245335
4 -1.205029  1.641572
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [48]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [49]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.775632
     two   0.580947
b    one  -0.542599
     two   0.245335

In [50]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [51]:
s_grouped

In [52]:
s_grouped.mean()

key1  key2
a     one     0.775632
      two     0.580947
b     one    -0.542599
      two     0.245335
Name: data2, dtype: float64

In [53]:
people = pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])

In [54]:
people.iloc[2:3,[1,2]] = np.nan

In [55]:
people

               a         b         c         d         e
Joe    -1.031589  0.802944  1.051409 -0.527540 -0.627094
Steve   1.436259  1.787629  0.501171  0.962157  1.777935
Wes    -0.727768       NaN       NaN  1.394053 -2.004880
Jim     1.134804 -1.716322 -0.862170 -0.569490  0.112161
Travis -1.097539  0.755910 -1.797895 -2.090782  1.114397

In [56]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}
by_column = people.groupby(mapping,axis=1)
by_column.sum()

            blue       red
Joe     0.523869 -0.855739
Steve   1.463328  5.001823
Wes     1.394053 -2.732648
Jim    -1.431659 -0.469357
Travis -3.888676  0.772767

In [57]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [58]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [59]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.624552 -0.913378  0.189240  0.297024 -2.519813
5  1.436259  1.787629  0.501171  0.962157  1.777935
6 -1.097539  0.755910 -1.797895 -2.090782  1.114397

In [60]:
key_list = ['one','one','one','two','two']
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.031589  0.802944  1.051409 -0.527540 -2.004880
  two  1.134804 -1.716322 -0.862170 -0.569490  0.112161
5 one  1.436259  1.787629  0.501171  0.962157  1.777935
6 two -1.097539  0.755910 -1.797895 -2.090782  1.114397

In [61]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])
hier_df = pd.DataFrame(np.random.randn(4,5),columns=columns)

In [62]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.409638 -0.327673  0.489219  1.507210  1.574458
1     -1.300505  1.310576  0.334265  1.557595 -1.351843
2     -0.716044 -0.707765 -1.226091  0.927956  1.174826
3     -1.478854 -0.124942 -0.483712 -0.719212  1.701134

In [63]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [64]:
df

      data1     data2 key1 key2
0 -0.523777 -0.090309    a  one
1  0.303250  0.580947    a  two
2  0.551000 -0.542599    b  one
3 -0.780171  0.245335    b  two
4 -1.205029  1.641572    a  one

In [65]:
grouped = df.groupby('key1')

In [66]:
grouped['data1'].quantile(0.9)  # 用于计算分位数

key1
a    0.137845
b    0.417883
Name: data1, dtype: float64

In [67]:
def peak_to_peak(arr):
    return arr.max() -arr.min()

In [68]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.508279  1.731882
b     1.331171  0.787934

In [69]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.475185  0.755313 -1.205029 -0.864403 -0.523777 -0.110263
b      2.0 -0.114585  0.941280 -0.780171 -0.447378 -0.114585  0.218208

              data2                                                    \
          max count      mean       std       min       25%       50%
key1
a     0.30325   3.0  0.710737  0.873205 -0.090309  0.245319  0.580947
b     0.55100   2.0 -0.148632  0.557153 -0.542599 -0.345616 -0.148632


           75%       max
key1
a     1.111260  1.641572
b     0.048351  0.245335

In [70]:
tips = pd.read_csv('I:\数据分析\pydata-book-2nd-edition\examples/tips.csv')

In [71]:
tips['tip_pct']=tips['tip']/tips['total_bill']
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [72]:
grouped = tips.groupby(['day','smoker'])
grouped_pct = grouped['tip_pct']

In [73]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [74]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [75]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [76]:
functions = ['count','mean','max']
result = grouped['tip_pct','total_bill'].agg(functions)

In [77]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [78]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [79]:
ftuples = [('Durchschnitt','mean'),('Abweichung',np.var)]
grouped['tip_pct','total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [80]:
grouped.agg({'tip':np.max,'size':'sum'})

             size    tip
day  smoker
Fri  No         9   3.50
     Yes       31   4.73
Sat  No       115   9.00
     Yes      104  10.00
Sun  No       167   6.00
     Yes       49   6.50
Thur No       112   6.70
     Yes       40   5.00

In [81]:
grouped.agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

            size   tip_pct
             sum       min       max      mean       std
day  smoker
Fri  No        9  0.120385  0.187735  0.151650  0.028123
     Yes      31  0.103555  0.263480  0.174783  0.051293
Sat  No      115  0.056797  0.291990  0.158048  0.039767
     Yes     104  0.035638  0.325733  0.147906  0.061375
Sun  No      167  0.059447  0.252672  0.160113  0.042347
     Yes      49  0.065660  0.710345  0.187250  0.154134
Thur No      112  0.072961  0.266312  0.160298  0.038774
     Yes      40  0.090014  0.241255  0.163863  0.039389

In [82]:
tips.groupby(['day','smoker'],as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [83]:
def top(df,n=5,column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [84]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [85]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [86]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [87]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [88]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [89]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [90]:
tips.groupby('smoker',group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [91]:
frame = pd.DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
quartiles = pd.cut(frame.data1,4)

In [92]:
quartiles[:10]

0    (-1.718, -0.105]
1    (-1.718, -0.105]
2     (-0.105, 1.508]
3      (1.508, 3.121]
4     (-0.105, 1.508]
5     (-0.105, 1.508]
6     (-0.105, 1.508]
7    (-1.718, -0.105]
8    (-1.718, -0.105]
9     (-0.105, 1.508]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.337, -1.718] < (-1.718, -0.105] < (-0.105, 1.508] < (1.508, 3.121]]

In [93]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),
           'count':group.count(),'mean':group.mean()}
grouped = frame.data2.groupby(quartiles)

In [94]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.337, -1.718]   43.0  2.604378  0.178417 -2.188505
(-1.718, -0.105]  431.0  2.593320  0.033172 -2.868178
(-0.105, 1.508]   441.0  3.083324  0.021149 -3.025059
(1.508, 3.121]     85.0  2.734727 -0.018819 -2.110204

In [95]:
grouping = pd.qcut(frame.data1,10,labels=False)
grouped = frame.data2.groupby(grouping)

In [96]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.604378  0.009283 -2.362649
1      100.0  2.593320  0.037983 -2.868178
2      100.0  2.328428  0.153907 -2.341337
3      100.0  1.799524 -0.039749 -2.800561
4      100.0  2.163178  0.033916 -2.357306
5      100.0  1.648845 -0.109695 -3.025059
6      100.0  2.867515  0.043593 -1.875645
7      100.0  2.837344 -0.045152 -2.750722
8      100.0  3.083324  0.245511 -1.959433
9      100.0  2.734727 -0.032635 -2.110204

In [97]:
# 325
import numpy as np
import pandas as pd
s = pd.Series(np.random.randn(6))

In [98]:
s[::2] = np.nan

In [99]:
s

0         NaN
1    1.382746
2         NaN
3    0.339120
4         NaN
5   -0.681850
dtype: float64

In [100]:
s.fillna(s.mean())

0    0.346672
1    1.382746
2    0.346672
3    0.339120
4    0.346672
5   -0.681850
dtype: float64

In [101]:
states = ['Ohio','New York','Vermont','Florida','Oregon','Nevada','California','Idaho']
group_key = ['East']*4 + ['West']*4
data = pd.Series(np.random.randn(8),index =states)
data

Ohio          0.543428
New York     -1.220089
Vermont      -1.399460
Florida      -0.745081
Oregon        2.033720
Nevada        0.100853
California    0.879245
Idaho         0.757494
dtype: float64

In [102]:
data[['Vermont','Nevada','Idaho']] = np.nan

In [103]:
data

Ohio          0.543428
New York     -1.220089
Vermont            NaN
Florida      -0.745081
Oregon        2.033720
Nevada             NaN
California    0.879245
Idaho              NaN
dtype: float64

In [104]:
data.groupby(group_key).mean()

East   -0.473914
West    1.456482
dtype: float64

In [11]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio          0.094791
New York      0.649363
Vermont       0.155416
Florida      -0.277907
Oregon       -1.148369
Nevada       -1.024875
California   -0.901381
Idaho        -1.024875
dtype: float64

In [12]:
fill_values = {'East':0.5,'West':-1}
fill_func = lambda g: g.fillna(fill_values[g.name])

In [13]:
data.groupby(group_key).apply(fill_func)

Ohio          0.094791
New York      0.649363
Vermont       0.500000
Florida      -0.277907
Oregon       -1.148369
Nevada       -1.000000
California   -0.901381
Idaho        -1.000000
dtype: float64

In [15]:
suits = ['H','S','C','D']
card_val = (list(range(1,11))+[10]*3)*4
base_names = ['A']+list(range(2,11))+['J','K','Q']
cards = []
for suit in ['H','S','C','D']:
    cards.extend(str(num)+suit for num in base_names)
deck = pd.Series(card_val, index = cards)

In [16]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [17]:
def draw(deck,n=5):
    return deck.sample(n)
draw(deck)

8H    8
4C    4
6C    6
9S    9
9H    9
dtype: int64

In [18]:
get_suit = lambda card: card[-1] # lasr letter is suit
deck.groupby(get_suit).apply(draw,n=2)

C  3C      3
   10C    10
D  6D      6
   4D      4
H  3H      3
   6H      6
S  KS     10
   6S      6
dtype: int64

In [19]:
deck.groupby(get_suit,group_keys=False).apply(draw,n=2)

8C     8
5C     5
6D     6
9D     9
QH    10
5H     5
8S     8
QS    10
dtype: int64

In [20]:
df = pd.DataFrame({'category':['a','a','a','a','b','b','b','b'],'data':np.random.randn(8),'weights':np.random.rand(8)})
df

  category      data   weights
0        a  0.427718  0.962534
1        a  0.045422  0.193507
2        a  1.210618  0.652457
3        a -1.224559  0.223059
4        b  1.038941  0.396498
5        b  0.921694  0.228468
6        b -0.002528  0.845135
7        b -0.407222  0.540898

In [21]:
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'],weights=g['weights'])
grouped.apply(get_wavg)

category
a    0.461326
b    0.198963
dtype: float64

In [22]:
close_px = pd.read_csv('I:\数据分析\pydata-book-2nd-edition\examples/stock_px_2.csv',parse_dates=True,index_col=0)
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [23]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [24]:
spx_corr = lambda x:x.corrwith(x['SPX'])

In [25]:
rets = close_px.pct_change().dropna()

In [26]:
get_year = lambda x: x.year

In [27]:
by_year = rets.groupby(get_year)

In [28]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [29]:
by_year.apply(lambda g:g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [30]:
import statsmodels.api as sm
def regress(data,yvar,xvars):
    Y = data[yvar]
    X = data[xvar]
    X['intercept']=1
    result = sm.OLS(Y,X).fit()
    return result.params

ImportError: cannot import name 'ss'

In [31]:
by_year.apply(regress,'AAPL',['SPX'])

NameError: name 'regress' is not defined

In [105]:
tips.pivot_table(index=['day','smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [106]:
tips.pivot_table(['tip_pct','size'],index=['time','day'],columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [107]:
tips.pivot_table(['tip_pct','size'],index=['time','day'],columns='smoker',margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [108]:
tips.pivot_table('tip_pct',index=['time','smoker'],columns='day',aggfunc=len,margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [109]:
tips.pivot_table('tip_pct',index=['time','size','smoker'],columns='day',aggfunc='mean',fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706